{
	"title": {
		"media": {
			"url": "Images/logo.jfif",
			"caption": "",
			"credit": "<a href='https://x.com/stridelysol/status/1517388736123879425'>Credits To The Owner</a>"
		},
		"text": {
			"headline": "Supervised vs. Unsupervised Learning",
			"text": "<p>Machine learning has evolved along two main paths: supervised learning, which learns from labeled data, and unsupervised learning, which finds patterns in unlabeled data.<br><br> <b>Let's delve into the history of machine learning...</b> </p> "
		}
	},
	"events": [
		{
			"media": {
				"url": "Images/Checkers.jpg",
				"caption": "An image from IBM where Arthur Samuel is testing the game."
			},
			"start_date": {
				"year": "1952"
			},
			"text": {
				"headline": "Samuel's Checkers Program",
				"text": "<p>Arthur Samuel developed a checkers game that improved by playing against itself and learning from outcomes. This was the first application of supervised learning in games.</p>"
			}
		},
		{
			"media": {
				"url": "Images/perceptron.jpg",
				"caption": "Diagram of Perceptron"				
			},
			"start_date": {
				"year": "1957"
			},
			"text": {
				"headline": "Creation of Perceptron (Rosenblatt)",
				"text": "<p>Frank Rosenblatt introduced the Perceptron, described as a simple neural model that can adjust weight values on labeled data on training. <br><br> Initially, it was used for binary classification tasks which can answer yes or no.</p>"
			}
		},
		{
			"media": {
				"url": "Images/kmeans.jpg",
				"caption": "Example of K means on a graph"
			},
			"start_date": {
				"year": "1957"
			},
			"text": {
				"headline": "k-Means (Lloyd)",
				"text": "<p>Along with the rising of supervised machine learning, Stuart Lloyd introduced the algorithm for quatizing signals, this was commonly know today as <b>k-Means</b>. <br><br> With this approach, there is no need to labels, just grouped by similar data points. </p>."
			}
		},
		{
			"media": {
				"url": "Images/regression.jpg",
				"caption": "Definition of Regression."
			},
			"start_date": {
				"year": "1970"
			},
			"text": {
				"headline": "Regression in Computing",
				"text": "<p>Known for their use on statistics, <b>Linear</b> and <b>Logistic</b> regression became standard computational tools for supervised prediction. These methods were evolved from being used for pure statistics into machine learning.</p>"
			}
		},
		{
			"media": {
				"url": "images/hopfield.jpg",
				"caption": "Visualization of what a hopfield network looks like."
			},
			"start_date": {
				"year": "1982"
			},
			"text": {
				"headline": "Hopfield Networks",
				"text": "Invented by Dr. John Hopfield, Hopfield Network is a fully interconnected neural network where each unit is connected to every other unit. It behaves in a discrete manner."
			}
		},
		{
			"media": {
				"url": "Images/backpropagation.jfif",
				"caption": "Visualization of Backpropagation in Neural Networks."
			},
			"start_date": {
				"year": "1986"
			},
			"text": {
				"headline": "Backpropagation",
				"text": "Reintroduced by Rumelhart, Hinton, and Williams. BackPropagation is a core algorithm in machine learning, particularly for training artificial neural networks. <br><br> It's goal is to reduce the difference between the model's predicted output and the actual output by adjusting the weights and biases in the network.."
			}
		},
		{
			"media": {
				"url": "Images/SOM.jfif",
				"caption": "Visualization of Self-Organizing Maps for Artificial Intelligence."			},
			"start_date": {
				"year": "1989"
			},
			"text": {
				"headline": "Self-Organizing Maps (Kohonen)",
				"text": "<p>Also known as <b>Kohonen Maps</b>, are a type of artificial neural network that uses unsupervised learning to cluster high-dimensional data into a lower-dimensional representation. This was pivotal in visualization and exploratory data analysis without labels.</b>.</p>"
			}
		},
		{
			"media": {
				"url": "Images/svm.jpg",
				"caption": "Visualization of Support Vector Machines"
			},
			"start_date": {
				"year": "1995"
			},
			"text": {
				"headline": "Support Vector Machines (SVMs)",
				"text": "<p>Is a supervised machine learning algoritm used for classification and regression tasks. It tries to find the best boundary known as <b>hyperplane</b> that separates different classes in the data.</p>"
			}
		},
		{
			"media": {
				"url": "Images/wave.jpg"
			},
			"start_date": {
				"year": "2000"
			},
			"text": {
				"headline": "The End!",
				"text": "<p>Thank You for reading my slides about the history of Maachine Learning.<br><br> <b>BYEEEEE!!!</b></p>"
			}
		}
		
	]
}
